In [1]:
import pandas as pd

C:\Users\brkyb\Anaconda\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [5]:
pd.__version__

'2.2.3'

In [6]:
products = ['A','B','C','D']
products

['A', 'B', 'C', 'D']

In [7]:
type(products)

list

In [8]:
# Series object is single-column data, or a set of values that correspond to a single variable.
# We can create a Series from a list(int and str but better if single type). or can be dict

In [9]:
# -----------------python Series-----------------
# turn list into Series
product_categories = pd.Series(products)

In [10]:
product_categories  # the default datatype assigned to data is not numeric -> dtype: objectqqsaw

0    A
1    B
2    C
3    D
dtype: object

In [11]:
type(product_categories)

pandas.core.series.Series

In [12]:
daily_rates_dollars = pd.Series([40, 45, 50, 60])
daily_rates_dollars

0    40
1    45
2    50
3    60
dtype: int64

In [13]:
print(daily_rates_dollars)

0    40
1    45
2    50
3    60
dtype: int64

In [15]:
#Pandas Series object corresponds to the one-dimensional NumPy array structure
#Series object can be created using NumPy array as well.
import numpy as np

In [16]:
array_a = np.array([10, 20, 30, 40, 50])
array_a

array([10, 20, 30, 40, 50])

In [17]:
type(array_a)

numpy.ndarray

In [19]:
#The pandas Series object is sth like a powerful version of the Python list,
# or an enhanced version of the NumPy array.
#doesn't mean Series should be preffered to list no matter what.
# Series -> A larger set of tools and capabilities that are pertinent to the pandas library only
series_a = pd.Series(array_a)
series_a

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [20]:
type(series_a)

pandas.core.series.Series

In [21]:
# ------------challenge---------------

products = ['laptop', 'smartphone', 'tablet', 'monitor', 'keyboard']
prices_usd = [1200, 800, 450, 300, 50]

# 1. Import the pandas and NumPy libraries as pd and np, respectively.
import pandas as pd 
import numpy as np 

# 2. Convert the products list into a pandas Series object named products_series.
products_series = pd.Series(products)

# 3. Display the content of products_series, then display its type.
print(products_series)
print(type(products_series))

# 4. Convert the prices_usd list into a NumPy array named prices_usd_array.
prices_usd_array = np.array(prices_usd)

# 5. Display the content of prices_usd_array, then display its type.
print(prices_usd_array)
print(type(prices_usd_array))

0        laptop
1    smartphone
2        tablet
3       monitor
4      keyboard
dtype: object
<class 'pandas.core.series.Series'>
[1200  800  450  300   50]
<class 'numpy.ndarray'>

In [22]:
#python objects contain: data, metadata(info about data), related functionalities 
# atts: a variable providing metadata about an object
#method: a function that can be associated with an object

In [23]:
#--------------working with attributes------------------
series_a = pd.Series([10,20,30,40,50])
series_a

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [24]:
series_a.dtype

dtype('int64')

In [25]:
series_a.size

5

In [41]:
product_categories = pd.Series(['A','B','C','D'])
product_categories

0    A
1    B
2    C
3    D
dtype: object

In [42]:
product_categories.dtype #'O' = Object - the deafult type assigned to non-numeric data

dtype('O')

In [43]:
product_categories.size

4

In [44]:
type(product_categories.size)

int

In [45]:
#at a certain moment in time atributes may contain no specific value
print(product_categories.name)

None

In [46]:
product_categories.name = "Product Categories"
product_categories

0    A
1    B
2    C
3    D
Name: Product Categories, dtype: object

In [47]:
product_categories.name

'Product Categories'

In [48]:
print(product_categories.name)

Product Categories

In [49]:
# -------------------Challenge----------------------
import pandas as pd
import numpy as np

units_sold = [100, 130, 86, 97, 43]

# 1. Store the units_sold list as a pandas Series object named units_sold_series.
units_sold_series = pd.Series(units_sold)

# 2. Assign it the following name: "Number of Units Sold per Product".
units_sold_series.name = "Number of Units Sold per Product"

# 3. Display the name of units_sold_series.
print(units_sold_series.name)

# 4. Display the size units_sold_series.
print(units_sold_series.size)

# 5. Display the content of units_sold_series.
print(units_sold_series)

# 6. Convert units_sold_series into a NumPy array and store it in a variable named units_sold_array.
# Display the units_sold_array.
units_sold_array = np.array(units_sold_series)
print(units_sold_array)
# 7. Display the type of the units_sold_array variable.
print(type(units_sold_array))

Number of Units Sold per Product
5
0    100
1    130
2     86
3     97
4     43
Name: Number of Units Sold per Product, dtype: int64
[100 130  86  97  43]
<class 'numpy.ndarray'>

In [3]:
#Dictionary
import pandas as pd 
prices_per_category = {'Product A': 22250, 'Product B': 16600, 'Product C': 15600}
prices_per_category

C:\Users\brkyb\Anaconda\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

{'Product A': 22250, 'Product B': 16600, 'Product C': 15600}

In [4]:
type(prices_per_category)

dict

In [6]:
prices_per_category = pd.Series(prices_per_category)
prices_per_category

Product A    22250
Product B    16600
Product C    15600
dtype: int64

In [7]:
type(prices_per_category)

pandas.core.series.Series

In [8]:
# index in pandas.Series
prices_per_category.index # The Series index is in fact a seperate object and it should be treated as such

Index(['Product A', 'Product B', 'Product C'], dtype='object')

In [9]:
 type(prices_per_category.index)

pandas.core.indexes.base.Index

In [10]:
#----------------CRUCIAL POINTS TO REMEMBER-----------------------
#An index allows you to refer to a position within a sequence, or- in other words, - a set of values in a sequenced order
# you will be able to quickly access the prices of the relevant categories through their respective indices 
# The index data structure will often turn out to be a way to speed up your computations while working with large datasets.

In [11]:
#pandas can also have implicit indices  - label-based indexing, postion-based indexing

In [12]:
# --------------------------challange---------------------------------
import pandas as pd

emp_monthly_salaries_usd = {
    "Alice Johnson": 5000,
    "Bob Smith": 4500,
    "Carol Davis": 5200,
    "David Brown": 4800,
    "Eve Wilson": 4700
}

# 1. Convert the Python dictionary into a pandas Series object named 
# emp_monthly_salaries_usd_series.
emp_monthly_salaries_usd_series = pd.Series(emp_monthly_salaries_usd)

# 2. Display the content of emp_monthly_salaries_usd_series to verify 
# that the dictionary's keys have turned into the index of the newly 
# created pandas Series object, while its values have remained as the 
# Series values.
print(emp_monthly_salaries_usd_series)

# 3. Display only the index of emp_monthly_salaries_usd_series.
print(emp_monthly_salaries_usd_series.index)

Alice Johnson    5000
Bob Smith        4500
Carol Davis      5200
David Brown      4800
Eve Wilson       4700
dtype: int64
Index(['Alice Johnson', 'Bob Smith', 'Carol Davis', 'David Brown',
       'Eve Wilson'],
      dtype='object')

In [13]:
#An index is a separate object that stores labels to reference the values in a pandas Series.
#When creating a pandas Series from a dictionary, the dictionary keys become the index of the Series.
#Label-based indexing refers to accessing data using labels (e.g., strings or categories), while position-based indexing uses numerical positions starting from 0.
#Label-based indexing can contain integer labels(not a good practive though)

In [14]:
#the panda Series index represents a very solid data structure : explicit, Implicit
# ındexing: Label based, position-based(zero-based)

In [15]:
series_a = pd.Series([10,20,30,40,50])  # this is ımplicit indexing cuz index were not defined so pandas attach it from zero default
series_a

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [16]:
series_a.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
type(series_a.index)

pandas.core.indexes.range.RangeIndex

In [18]:
list(series_a.index)

[0, 1, 2, 3, 4]

In [19]:
prices_per_category = pd.Series({'Product A': 22250, 'Product B': 16600, 'Product C': 12500})
prices_per_category

Product A    22250
Product B    16600
Product C    12500
dtype: int64

In [20]:
prices_per_category.index

Index(['Product A', 'Product B', 'Product C'], dtype='object')

In [21]:
type(prices_per_category.index)

pandas.core.indexes.base.Index

In [22]:
# if user doesnt specify the index panda will immediately attach the deafult zero-based indexing to their object
# they can refer to the object's values via their positions
# providing index to pandas Series or dataframe called: explicit, if not attached than pandas default start from 0 and its implicit

In [23]:
series_a = pd.Series([10,20,30,40,50]) 
prices_per_category = pd.Series({'Product A': 22250, 'Product B': 16600, 'Product C': 12500})

In [24]:
series_a

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [25]:
series_a[0]

10

In [26]:
prices_per_category

Product A    22250
Product B    16600
Product C    12500
dtype: int64

In [28]:
prices_per_category['Product A']

22250

In [29]:
prices_per_category[0] #python has implicitly provides a default integer index

C:\Users\brkyb\AppData\Local\Temp\ipykernel_18200\1694906638.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  prices_per_category[0]

22250

In [30]:
prices_per_category[2]

C:\Users\brkyb\AppData\Local\Temp\ipykernel_18200\2291720152.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  prices_per_category[2]

12500

In [33]:
series_b = pd.Series([10,20,30,40,50], index = [1,2,3,4,5])  #explicit index
series_b

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [ ]:
series_b[0] # -- error cuz;
# python treated the integer from 1 to 5 as index labels, we wont have an implicit numeric index additionally.

In [34]:
series_b[1] #1.index position,   2.index labels(/numbers written as strings/)

10

In [35]:
series_c = pd.Series([10,20,30,40,50], index = ["1", "2", "3", "4", "5"])
series_c

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [36]:
series_c[1] # gonna start from 0.

C:\Users\brkyb\AppData\Local\Temp\ipykernel_18200\2194739140.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series_c[1]

20

In [37]:
series_c["1"]

10

In [38]:
prices_per_category  # axis labels = label-based indexing

Product A    22250
Product B    16600
Product C    12500
dtype: int64

In [39]:
# ----------------------------------------------------------------------------------------------
# index labels = non-numeric index
#using index label to explicitly refers to certain parts of your data
# position-based indexing has its strong points as well -> imagine you working with a large dataset and u wanna retrieve the 
#first 100 rows of ur data, or examine the last 10 rows,  you'll use position-based indexing rather than label-based indexing

In [40]:
# --------------------------------challenge-----------------------------------
import pandas as pd
import numpy as np

integers_array = np.array([456, 12, 325, 100])
print(integers_array)

# 1. Convert integers_array into a pandas Series object named 
# integers_series.
integers_series = pd.Series(integers_array)

# 2. Use Python indexing to quickly verify the index values of integers_series 
# are composed of integers.
print(type(integers_series.index[0]))

[456  12 325 100]
<class 'int'>

In [41]:
# python object is associated with a certain collection of atts and methods
#attributes(passive) provide metadata
# methods(active ): Functionalities and behaviour of the object

In [42]:
# ----------------------------------------Using methods in python-------------------------------------------
#  -> When provided with some initial data, both tools can make specific operations with it and return an output.
#1 Functions -> Independent entity
# 2.Methods  -> can have access to the object's data, can manipulate object's state
# Different libraries contain their own sets of methods

In [47]:
start_date_deposits = pd.Series({
    '7/4/2014'   : 2000,
    '1/2/2015'   : 2000,
    '12/8/2012'   : 1000,
    '2/20/2015'   : 2000,
    '10/28/2013'   : 2000,
    '4/19/2015'   : 2000,
    '7/4/2016'   : 2000,
    '4/24/2014'   : 2000,
    '9/3/2015'   : 4000,
    '7/25/2016'   : 2000,
    '5/1/2014'   : 2000,
    '3/29/2013'   : 2000,
    '10/3/2014'   : 2000,
    '9/18/2015'   : 2500
})

In [48]:
start_date_deposits

7/4/2014      2000
1/2/2015      2000
12/8/2012     1000
2/20/2015     2000
10/28/2013    2000
4/19/2015     2000
7/4/2016      2000
4/24/2014     2000
9/3/2015      4000
7/25/2016     2000
5/1/2014      2000
3/29/2013     2000
10/3/2014     2000
9/18/2015     2500
dtype: int64

In [49]:
start_date_deposits.sum()

29500

In [50]:
start_date_deposits.min()

1000

In [51]:
start_date_deposits.max()

4000

In [52]:
start_date_deposits.idxmax()

'9/3/2015'

In [53]:
start_date_deposits.idxmin()

'12/8/2012'

In [56]:
# NumPy -> Numeric data only, Pandas -> Noth numeric and non-numeric data
# What kind of methods is exist in Pandas and why? 
# Pandas is a library, which steps on the computational abilities of NumPy 
#pandas wont deprive you of certain mathematical operations when you need them 
#Mathematical methods,

In [57]:
start_date_deposits.head() #first 5 row

7/4/2014      2000
1/2/2015      2000
12/8/2012     1000
2/20/2015     2000
10/28/2013    2000
dtype: int64

In [58]:
start_date_deposits.tail() # last 5 row

7/25/2016    2000
5/1/2014     2000
3/29/2013    2000
10/3/2014    2000
9/18/2015    2500
dtype: int64

In [59]:
# one of the best features of using methods is that we can also modify their performance.
# Parameters, Arguments
start_date_deposits.head(10)

7/4/2014      2000
1/2/2015      2000
12/8/2012     1000
2/20/2015     2000
10/28/2013    2000
4/19/2015     2000
7/4/2016      2000
4/24/2014     2000
9/3/2015      4000
7/25/2016     2000
dtype: int64

In [61]:
start_date_deposits.head(2) # argument(our choice for n), paremeter(n) .head()

7/4/2014    2000
1/2/2015    2000
dtype: int64

In [62]:
start_date_deposits.head(n=3)

7/4/2014     2000
1/2/2015     2000
12/8/2012    1000
dtype: int64

In [63]:
# --------------------------Dataframe-----------------------------
#--------Series(rows, col) -> corresponds to single variable, info of a single type, we can preserve data consistency
#series is powerful version of py list + py dict feature , indexing to keys of a dict

#------DataFrame(rows,cols) -> (multi-colun data). each col represents a diff variable. every col contains data of its own type, 
#the info can potentially be heteregenous, we can preserve data consistency(aimed having info of same type within certain colum)
#inherits characteristics of dict class + alot more features and functionailties
#Dataframe is enhanced py dict index of cols +rows

In [64]:
# creating DataFrame from a dict 
data = {'ProductName':['Product A', 'Product B', 'Product C'], 'ProductPrice':[22250, 16600, 12500]}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [ ]:
# Product D cause error cuz no price defined
data = {'ProductName':['Product A', 'Product B', 'Product C', 'Product D'], 'ProductPrice':[22250, 16600, 12500]}
df = pd.DataFrame(data)
df

In [66]:

data = {'ProductName':['Product A', 'Product B', 'Product C'], 'ProductPrice':[22250, 16600, 12500]}
df = pd.DataFrame(data, index = ['A','B','C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [70]:
data = {'ProductName':['Product A', 'Product B', 'Product C'], 'ProductPrice':[22250, 16600, 12500]}
ProductID = (['A','B','C'])
df = pd.DataFrame(data, index = ProductID)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [71]:
data = {'ProductName':['Product A', 'Product B', 'Product C'], 'ProductPrice':[22250, 16600, 12500]}
ProductID = (['A','B','C'])
df = pd.DataFrame(data, index = ProductID)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [101]:
# LİST OF DİCTİONARİES
data =  [{'ProductName': 'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice': 16600},
        {'ProductName': 'Product C', 'ProductPrice': 12500}]
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [75]:
data =  [{'ProductName': 'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice': 16600},
        {'ProductName': 'Product C', 'ProductPrice': [12500,100000]}] # data consistency is ruined
data = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [ ]:
data =  [{'ProductName': 'Product A', 'ProductPrice': 22250},
        {'ProductName': 'Product B', 'ProductPrice': 16600},
        {'ProductName': 'Product C', 'ProductPrice': 12500}
        {'ProductName': 'Product D',] # syntaxerror no val defıned 
data = pd.DataFrame(data)
df

In [ ]:
# -------------CREATING DATAFRAME-------------------
    # from a dictionaries of lists
    # from a dictionary of lists + specifying an index
    # from a list of dictionaries
    #                   4. from a dictionary of pandas Series
    #                   5. from a list of lists
    #                   6. in a professional way

In [ ]:
#4--------------Construct a DataFrame from a dictionary of pandas Series--------------------------

In [77]:
ser_products = pd.Series(['Product A','Product B','Product C'])
ser_prices = pd.Series([22250, 16600, 12500])

In [78]:
data = {'ProductName': ser_products, 'ProductPrice': ser_prices }
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [80]:
ser_products = pd.Series(['Product A','Product B','Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['A', 'B', 'C'])

data = {'ProductName': ser_products, 'ProductPrice': ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [81]:
ser_products = pd.Series(['Product A','Product B','Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['C', 'B', 'A'])

data = {'ProductName': ser_products, 'ProductPrice': ser_prices}
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
A   Product A         12500
B   Product B         16600
C   Product C         22250

In [ ]:
# 5----------------------Construct a DataFrame from a list of lists---------------------

In [82]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [83]:
# we must be careful when macthing the number of elements we have accross the horizontal axis
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500, 5000]]
df = pd.DataFrame(data)
df

           0      1       2
0  Product A  22250     NaN
1  Product B  16600     NaN
2  Product C  12500  5000.0

In [86]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df.columns = ['ProductName', 'ProductPrice']
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [88]:
df.index = ['A', 'B', 'C']
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [ ]:
#6 ---------------------Construct a DataFrame in a Professional way---------------------------------

#while constructing a DatFrame you need to provide info about:
#    1. its data
#    2.its columns
#    3.İts index                  -- this 3 are required

In [99]:
df = pd.DataFrame(data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]],
                  columns = ['ProductName', 'ProductPrice'],
                  index = ['A', 'B', 'C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [100]:
df.shape #row , col

(3, 2)

In [103]:
# ----------------------challange -------------------------------
import pandas as pd

# 1. ... by using a dictionary of lists.
data_dict_of_lists = {
    "Employee": ["John Doe", "Jane Smith", "Michael Roberts", "Emily Davis", "Chris Green", "Jessica Wilson", "Daniel Kim", "Sophia Martinez"],
    "Monthly Salary ($)": [5200, 4800, 5000, 5300, 4600, 4950, 5100, 4700]
}
df1 = pd.DataFrame(data_dict_of_lists)
print(df1)

import pandas as pd

# -------------------------------------------------------------------------

# 2. ... by using a list of dictionaries.
data_list_of_dicts = [
    {"Employee": "John Doe", "Monthly Salary ($)": 5200},
    {"Employee": "Jane Smith", "Monthly Salary ($)": 4800},
    {"Employee": "Michael Roberts", "Monthly Salary ($)": 5000},
    {"Employee": "Emily Davis", "Monthly Salary ($)": 5300},
    {"Employee": "Chris Green", "Monthly Salary ($)": 4600},
    {"Employee": "Jessica Wilson", "Monthly Salary ($)": 4950},
    {"Employee": "Daniel Kim", "Monthly Salary ($)": 5100},
    {"Employee": "Sophia Martinez", "Monthly Salary ($)": 4700}
]
df2 = pd.DataFrame(data_list_of_dicts)
print(df2)

# -------------------------------------------------------------------------

# 3. ... by using a dictionary of pandas Series (named names and monthly_salary).
names = pd.Series(["John Doe", "Jane Smith", "Michael Roberts", "Emily Davis", 
                   "Chris Green", "Jessica Wilson", "Daniel Kim", "Sophia Martinez"], 
                  name="Employee")
monthly_salary = pd.Series([5200, 4800, 5000, 5300, 4600, 4950, 5100, 4700], 
                           name="Monthly Salary ($)")
data_dict_of_series = {
    "Employee": names,
    "Monthly Salary ($)": monthly_salary
}
df3 = pd.DataFrame(data_dict_of_series)
print(df3)

# -------------------------------------------------------------------------

# 4. ... by using a list of lists.
data_list_of_lists = [
    ["John Doe", 5200],
    ["Jane Smith", 4800],
    ["Michael Roberts", 5000],
    ["Emily Davis", 5300],
    ["Chris Green", 4600],
    ["Jessica Wilson", 4950],
    ["Daniel Kim", 5100],
    ["Sophia Martinez", 4700]
]
df4 = pd.DataFrame(data_list_of_lists, columns=["Employee", "Monthly Salary ($)"])
print(df4)

          Employee  Monthly Salary ($)
0         John Doe                5200
1       Jane Smith                4800
2  Michael Roberts                5000
3      Emily Davis                5300
4      Chris Green                4600
5   Jessica Wilson                4950
6       Daniel Kim                5100
7  Sophia Martinez                4700
          Employee  Monthly Salary ($)
0         John Doe                5200
1       Jane Smith                4800
2  Michael Roberts                5000
3      Emily Davis                5300
4      Chris Green                4600
5   Jessica Wilson                4950
6       Daniel Kim                5100
7  Sophia Martinez                4700
          Employee  Monthly Salary ($)
0         John Doe                5200
1       Jane Smith                4800
2  Michael Roberts                5000
3      Emily Davis                5300
4      Chris Green                4600
5   Jessica Wilson                4950
6       Daniel Kim                5100
7  Sophia Martinez                4700
          Employee  Monthly Salary ($)
0         John Doe                5200
1       Jane Smith                4800
2  Michael Roberts                5000
3      Emily Davis                5300
4      Chris Green                4600
5   Jessica Wilson                4950
6       Daniel Kim                5100
7  Sophia Martinez                4700

### Data Cleaning/cleansing and Data Preprocessing

In [ ]:
# NumPy to Preprocessing the data
# Pandas to cleaning the data

In [109]:
import pandas as pd

In [134]:
data = pd.read_csv('Location.csv')
location_data = data.squeeze()
location_data

0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [135]:
location_data.head()

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [136]:
location_data.describe()

count            1043
unique            296
top       Location 25
freq               31
Name: Location, dtype: object

In [137]:
len(location_data)

1043

In [138]:
location_data.nunique() #.nunique() -> An integer representing the number of unique values in the Series.

296

In [141]:
type(location_data.nunique())

int

In [142]:
location_data.unique() # return all 296 unıque val  
# it delivers the values in the order they have appeared in the dataset.

array(['Location 3', 'Location 6', 'Location 8', 'Location 26',
       'Location 34', 'Location 25', 'Location 46', 'Location 156',
       'Location 21', 'Location 13', 'Location 579', 'Location 602',
       'Location 10', 'Location 44', 'Location 30', 'Location 48',
       'Location 196', 'Location 64', 'Location 91', 'Location 62',
       'Location 75', 'Location 42', 'Location 233', 'Location 95',
       'Location 78', 'Location 61', 'Location 87', 'Location 19',
       'Location 115', 'Location 350', 'Location 377', 'Location 17',
       'Location 113', 'Location 81', 'Location 58', 'Location 212',
       'Location 53', 'Location 337', 'Location 41', 'Location 632',
       'Location 73', 'Location 214', 'Location 218', 'Location 38',
       'Location 172', 'Location 197', 'Location 101', 'Location 185',
       'Location 129', 'Location 235', 'Location 142', 'Location 50',
       'Location 76', 'Location 11', 'Location 33', 'Location 22',
       'Location 145', 'Location 203', 'Location 94', 'Location 573',
       'Location 27', 'Location 186', 'Location 4', 'Location 70',
       'Location 45', 'Location 262', 'Location 111', 'Location 84',
       'Location 108', 'Location 7', 'Location 74', 'Location 450',
       'Location 47', 'Location 37', 'Location 43', 'Location 286',
       'Location 89', 'Location 24', 'Location 97', 'Location 144',
       'Location 40', 'Location 128', 'Location 169', 'Location 399',
       'Location 23', 'Location 191', 'Location 178', 'Location 510',
       'Location 600', 'Location 188', 'Location 67', 'Location 49',
       'Location 29', 'Location 222', 'Location 386', 'Location 88',
       'Location 104', 'Location 405', 'Location 114', 'Location 259',
       'Location 182', 'Location 12', 'Location 228', 'Location 149',
       'Location 90', 'Location 109', 'Location 441', 'Location 421',
       'Location 641', 'Location 195', 'Location 20', 'Location 161',
       'Location 117', 'Location 200', 'Location 106', 'Location 31',
       'Location 122', 'Location 541', 'Location 495', 'Location 193',
       'Location 39', 'Location 9', 'Location 86', 'Location 107',
       'Location 198', 'Location 318', 'Location 135', 'Location 177',
       'Location 32', 'Location 591', 'Location 488', 'Location 418',
       'Location 587', 'Location 454', 'Location 543', 'Location 489',
       'Location 60', 'Location 52', 'Location 548', 'Location 15',
       'Location 240', 'Location 658', 'Location 209', 'Location 151',
       'Location 192', 'Location 364', 'Location 18', 'Location 503',
       'Location 482', 'Location 460', 'Location 71', 'Location 69',
       'Location 258', 'Location 204', 'Location 124', 'Location 168',
       'Location 35', 'Location 296', 'Location 136', 'Location 28',
       'Location 153', 'Location 99', 'Location 132', 'Location 427',
       'Location 118', 'Location 127', 'Location 159', 'Location 154',
       'Location 175', 'Location 120', 'Location 82', 'Location 152',
       'Location 56', 'Location 282', 'Location 566', 'Location 365',
       'Location 353', 'Location 66', 'Location 2', 'Location 323',
       'Location 473', 'Location 206', 'Location 57', 'Location 68',
       'Location 166', 'Location 1', 'Location 227', 'Location 79',
       'Location 642', 'Location 105', 'Location 644', 'Location 547',
       'Location 637', 'Location 59', 'Location 574', 'Location 529',
       'Location 554', 'Location 275', 'Location 589', 'Location 160',
       'Location 410', 'Location 146', 'Location 221', 'Location 265',
       'Location 569', 'Location 157', 'Location 648', 'Location 165',
       'Location 651', 'Location 266', 'Location 77', 'Location 158',
       'Location 336', 'Location 72', 'Location 463', 'Location 253',
       'Location 5', 'Location 431', 'Location 515', 'Location 226',
       'Location 140', 'Location 110', 'Location 202', 'Location 634',
       'Location 138', 'Location 217', 'Location 443', 'Location 627',
       'Location 123', 'Location 528', 'Location 357', 'Location 187',
       'Location 315', 'Location 112', 'Location 302', 'Location 194',
       'Location 332', 'Location 208', 'Location 179', 'Location 199',
       'Location 201', 'Location 174', 'Location 474', 'Location 184',
       'Location 63', 'Location 512', 'Location 403', 'Location 436',
       'Location 210', 'Location 468', 'Location 464', 'Location 98',
       'Location 102', 'Location 325', 'Location 267', 'Location 173',
       'Location 617', 'Location 141', 'Location 300', 'Location 216',
       'Location 506', 'Location 647', 'Location 402', 'Location 239',
       'Location 54', 'Location 137', 'Location 477', 'Location 586',
       'Location 472', 'Location 374', 'Location 458', 'Location 180',
       'Location 653', 'Location 16', 'Location 612', 'Location 505',
       'Location 631', 'Location 299', 'Location 65', 'Location 342',
       'Location 155', 'Location 511', 'Location 461', 'Location 244',
       'Location 207', 'Location 597', 'Location 352', 'Location 533',
       'Location 384', 'Location 80', 'Location 171', 'Location 143',
       'Location 576', 'Location 139', 'Location 125', 'Location 181'],
      dtype=object)

In [143]:
type(location_data.unique()) # dont forget () cuz other wıse will return non logic result

numpy.ndarray

In [145]:
type(location_data.nunique())

int

In [ ]:
import pandas as pd

# 1. Load the "Region-exercise.csv" file and use the .squeeze("columns") method 
# or .squeeze(1) to ensure that any single-column DataFrame is converted into a Series. Store the result in a variable named data.
data = pd.read_csv('Region-exercise.csv').squeeze("columns")

# 2. Copy the data into a new variable called region_data.
region_data = data.copy()

# 3. Verify the type of the region_data variable.
print(type(region_data))

# 4. Use the .describe() method to obtain descriptive statistics on the 
# region_data Series.
print(region_data.describe())

# 5. Find the number of unique values in the region_data Series.
print(region_data.nunique())

# 6. Retrieve all unique values from the region_data Series as a NumPy array.
print(region_data.unique())

In [146]:
import pandas as pd 
import numpy as np

In [147]:
prices_per_Category = pd.Series({'Product A': 22250, 'Product B': 16600, 'Product C': 15600})
prices_per_Category

Product A    22250
Product B    16600
Product C    15600
dtype: int64

In [148]:
prices_per_Category.values # not recommended

array([22250, 16600, 15600], dtype=int64)

In [149]:
type(prices_per_Category.values)

numpy.ndarray

In [150]:
prices_per_Category.array # u need to use wheather array or .to.numpy() tocheck

<NumpyExtensionArray>
[22250, 16600, 15600]
Length: 3, dtype: int64

In [151]:
type(prices_per_Category.array)

pandas.core.arrays.numpy_.NumpyExtensionArray

In [152]:
prices_per_Category.to_numpy()

array([22250, 16600, 15600], dtype=int64)

In [154]:
type(prices_per_Category.to_numpy())

numpy.ndarray

In [ ]:
#pandas array will be used when your work is exclusively centered around the 
#functionalities of the pandas library

# this type of conversion .to_numpy() allows you to proceed with mathematical and statistical computations of further preprocessing of your data.

# this method above has been introduced to satisfy the increased demand for improved transformations of pandas Series into NumPy arrays

In [ ]:
# by using list of strings we can designate thef

In [156]:
# turn ınts ınto floats
test_array = prices_per_Category[['Product A', 'Product B']].to_numpy(dtype='float')
test_array

array([22250., 16600.])

In [157]:
type(test_array[0])

numpy.float64

In [158]:
prices_per_Category.values[0]

22250

In [ ]:
# .values, .array, .to_numpy()  -> convert your Series into an array

In [159]:
type(prices_per_Category.values[0])

numpy.int64

In [160]:
prices_per_Category.array[0]

22250

In [161]:
type(prices_per_Category.array[0])

numpy.int64

In [ ]:
# we should comply with the recommendations provided by the pandas developers

# .array -> will convert your Series into a pandas array which is an ExtensionArray useful in pandas 

# .to_numpy() -> for Pure numpy structure, .to_numpy

###

In [ ]:
# sometimes need to order values or or few of columns...

In [ ]:
# panda Series: .sort_values()

In [162]:
numbers = pd.Series([15,1000,23,45,444])
numbers

0      15
1    1000
2      23
3      45
4     444
dtype: int64

In [163]:
numbers.sort_values() # default ascending

0      15
2      23
3      45
4     444
1    1000
dtype: int64

In [165]:
numbers.sort_values(ascending = False)

1    1000
4     444
3      45
2      23
0      15
dtype: int64

In [169]:
location_data

0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [170]:
location_data.head()

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [171]:
# .sort_values() arranges the values of the object its been applied to 
# the index values comply with the object's data  that will lead the way
location_data.sort_values() #1,10,100.. not 1,2,3

637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
          ...
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99
Name: Location, Length: 1043, dtype: object

In [172]:
location_data.sort_values(ascending = False)

372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
          ...
202    Location 10
298    Location 10
637     Location 1
884     Location 1
465     Location 1
Name: Location, Length: 1043, dtype: object

In [ ]:
# ------------------attribute and method chaining------------------------

# Method chaining saves you the time necessary for creating a variable and thinking of a relevant name

In [173]:
location_data.head()

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [174]:
location_data.index

RangeIndex(start=0, stop=1043, step=1)

In [175]:
location_data.name

'Location'

In [177]:
location_data.index.name #no result

In [178]:
location_data.index.name = "Index"

In [179]:
location_data.index.name

'Index'

In [180]:
location_data

Index
0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [181]:
location_data.sort_values()

Index
637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
          ...
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99
Name: Location, Length: 1043, dtype: object

In [182]:
location_data.sort_values().head()

Index
637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
Name: Location, dtype: object

In [183]:
location_data.sort_values().tail()

Index
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99
Name: Location, dtype: object

In [184]:
location_data.index

RangeIndex(start=0, stop=1043, step=1, name='Index')

In [185]:
type(location_data.index)

pandas.core.indexes.range.RangeIndex

In [186]:
location_data.index.to_numpy()

array([   0,    1,    2, ..., 1040, 1041, 1042], dtype=int64)

In [ ]:
# --------------------challange--------------------------------
import pandas as pd

# 1. Load the "Integers.csv" file and use the .squeeze("columns") method or .squeeze(1) 
# to ensure that any single-column DataFrame is converted into a Series. 
# Store the result in a variable named data.
data = pd.read_csv("Integers.csv")
data = data.squeeze("columns")

# 2. Copy the contents of data into a new variable called integer_data.
integer_data = data.copy()

# 3. Sort all values in integer_data in descending order.
# Use the print() function to display only the top four rows of the sorted result.
print(integer_data.sort_values(ascending = False ).head(4))

In [ ]:
# ------- chaining technique - assignment statements
#   .sort_values() , .sort_index()

In [187]:
location_data.sort_values(ascending=False)

Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
          ...
202    Location 10
298    Location 10
637     Location 1
884     Location 1
465     Location 1
Name: Location, Length: 1043, dtype: object

In [188]:
location_data_sv = location_data.sort_values(ascending=False)
location_data_sv.head()

Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
Name: Location, dtype: object

In [190]:
location_data_sv.index

Index([ 372,  757,  128,  482,  271,  669,  612,   29,  518,  598,
       ...
        904,  912, 1010,   14,  716,  202,  298,  637,  884,  465],
      dtype='int64', name='Index', length=1043)

In [191]:
location_data_sv.index.sort_values()

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042],
      dtype='int64', name='Index', length=1043)

In [192]:
location_data_sv.head()

Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
Name: Location, dtype: object

In [197]:
location_data_sv

Index
0       Location 99
1       Location 98
2       Location 97
3       Location 97
4       Location 97
           ...
1038    Location 10
1039    Location 10
1040     Location 1
1041     Location 1
1042     Location 1
Name: Location, Length: 1043, dtype: object

In [198]:
location_data_sv = location_data.sort_values(ascending = False)
location_data_sv.head()

Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
Name: Location, dtype: object

In [199]:
location_data_sv.sort_index()

Index
0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [200]:
location_data_sv

Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
          ...
202    Location 10
298    Location 10
637     Location 1
884     Location 1
465     Location 1
Name: Location, Length: 1043, dtype: object

In [201]:
location_data_sv = location_data_sv.sort_index(ascending = True)
location_data_sv

Index
0        Location 3
1        Location 6
2        Location 8
3       Location 26
4       Location 34
           ...
1038    Location 73
1039    Location 82
1040    Location 11
1041    Location 26
1042    Location 94
Name: Location, Length: 1043, dtype: object

In [ ]:
# -----------challenge------------------
import pandas as pd

# 1. Load the "Integers.csv" file and use the .squeeze("columns") method or .squeeze(1) 
# to ensure that any single-column DataFrame is converted into a Series. 
# Store the result in a variable named data.

data = pd.read_csv("Integers.csv").squeeze("columns")

# 2. Copy the contents of data into a new variable called integer_data.
integer_data = data

# 3. Sort all values in integer_data in descending order. Store the output in a 
# variable called sorted_data.
integer_data = integer_data.sort_values(ascending = False)

# 4. Sort the index of the sorted_data Series in descending order by setting 
# the ascending parameter to False. Use the print() function to display the output.
print(integer_data.sort_index(ascending = False))

### a Revision to pandas DataFrame

In [ ]:
# the most important structure in the pandas library
# DataFrame - a tabular structure that contains multiple observations for a given set of variables

In [9]:
import pandas as pd 
import numpy as np 
array_a = np.array([[3,2,1], [6,3,2]])
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [10]:
type(pd.DataFrame(array_a)) #  array_a -> DataFrame

pandas.core.frame.DataFrame

In [11]:
df = pd.DataFrame(array_a, columns = ['Column 1', 'Column 2', 'Column 3'])
df

   Column 1  Column 2  Column 3
0         3         2         1
1         6         3         2

In [15]:
df = pd.DataFrame(array_a, columns = ['Col 1', 'Col2', 'Col3'], index = ['row1', 'row2'])
df

      Col 1  Col2  Col3
row1      3     2     1
row2      6     3     2

In [25]:
data = pd.read_csv('Lending-company.csv', index_col = 'LoanID') # index_col is a parameter -> transforms the specified column into row labels (index), 
# LoanID is no longer a column but the index of the DataFrame. 
lending_co_data = data.copy()
lending_co_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [ ]:
# -------common attributes for working with DataFrames

In [28]:
lending_co_data.index

Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
       ...
       1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
      dtype='int64', name='LoanID', length=1043)

In [30]:
type(lending_co_data.index)

pandas.core.indexes.base.Index

In [31]:
lending_co_data.columns

Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
       'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
       'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
      dtype='object')

In [32]:
lending_co_data.values

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [33]:
type(lending_co_data.values) # returns the data as a NumPy array.

numpy.ndarray

In [35]:
lending_co_data.to_numpy() # returns the data as a NumPy array.

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [37]:
type(lending_co_data.to_numpy())

numpy.ndarray

In [39]:
lending_co_data.shape# num of row and col

(1043, 14)

In [40]:
len(lending_co_data)

1043

In [41]:
len(lending_co_data.columns)

14

In [42]:
len(lending_co_data.index)

1043

In [ ]:
# ----------Data Selection------------
# Data selection or subset selection ina pandas DataFrame, means extracting elements, rows, columns, or subsets from such an object
# Data selection allows us to work on just a portion of a dataset 
# 1. indexing (row index, column index)

In [46]:
data = pd.read_csv('Lending-company.csv', index_col = 'StringID')
lending_co_data = data.copy()
lending_co_data

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
LoanID_1039,1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
LoanID_1040,1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
LoanID_1041,1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
LoanID_1042,1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
LoanID_1043,1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [47]:
# call col
lending_co_data.Product

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [49]:
lending_co_data.Location

StringID
LoanID_1        Location 3
LoanID_2        Location 6
LoanID_3        Location 8
LoanID_4       Location 26
LoanID_5       Location 34
                  ...
LoanID_1039    Location 73
LoanID_1040    Location 82
LoanID_1041    Location 11
LoanID_1042    Location 26
LoanID_1043    Location 94
Name: Location, Length: 1043, dtype: object

In [50]:
lending_co_data['Product']

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [51]:
type(lending_co_data['Product'])

pandas.core.series.Series

In [52]:
lending_co_data[['Product']] # a nested list containing a single element.
# nesting a list within the indexing operator is most needed when we want to 
# extract data from several columns

               Product
StringID
LoanID_1     Product B
LoanID_2     Product D
LoanID_3     Product B
LoanID_4     Product A
LoanID_5     Product B
...                ...
LoanID_1039  Product B
LoanID_1040  Product A
LoanID_1041  Product A
LoanID_1042  Product B
LoanID_1043  Product A

[1043 rows x 1 columns]

In [53]:
type(lending_co_data[['Product']])

pandas.core.frame.DataFrame

In [54]:
lending_co_data[['Location', 'Product']].head() # extract these 2 col

             Location    Product
StringID
LoanID_1   Location 3  Product B
LoanID_2   Location 6  Product D
LoanID_3   Location 8  Product B
LoanID_4  Location 26  Product A
LoanID_5  Location 34  Product B

In [56]:
# more elegant way to obtain the same result is to store the list containing the
# column names in a seperate variable
prod_loc = ['Location', 'Product']
lending_co_data[prod_loc].head()

             Location    Product
StringID
LoanID_1   Location 3  Product B
LoanID_2   Location 6  Product D
LoanID_3   Location 8  Product B
LoanID_4  Location 26  Product A
LoanID_5  Location 34  Product B

In [ ]:
lending_co_data['Product', 'Location'] # -- raises error

### pandas.DataFrame.iloc - position-based indexing 
##### loc -> label-based

In [ ]:
# i = integer , loc = location
# its called iloc indexer

# some rules applying for indexsing;
    # py lists
    # pandas Series by index position
    # pandas Series and DataFrames with .iloc[]

# strict implicit, integer-location, position-based indexing

In [ ]:
#classic indexing positior

In [58]:
lending_co_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [ ]:
lending_co_data[1]
lending_co_data[1] # --raise error

In [61]:
lending_co_data['Product'] # product is label here

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [62]:
lending_co_data.iloc[1]

LoanID                     2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: LoanID_2, dtype: object

In [63]:
lending_co_data.iloc[0,2] # first row, 3rd column

'Female'

In [64]:
lending_co_data.iloc[1,3]

'Location 6'

In [ ]:
# iloc[] has been programmed to deliver the desired portion of the dataset
#whether we provide one or two location specifiers

In [65]:
# return all from the second row
lending_co_data.iloc[1, :] # : -> data from all col

LoanID                     2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: LoanID_2, dtype: object

In [66]:
lending_co_data.iloc[:, 3]

StringID
LoanID_1        Location 3
LoanID_2        Location 6
LoanID_3        Location 8
LoanID_4       Location 26
LoanID_5       Location 34
                  ...
LoanID_1039    Location 73
LoanID_1040    Location 82
LoanID_1041    Location 11
LoanID_1042    Location 26
LoanID_1043    Location 94
Name: Location, Length: 1043, dtype: object

In [67]:
type(lending_co_data.iloc[0,2])

str

In [68]:
type(lending_co_data.iloc[1, :])

pandas.core.series.Series

In [69]:
type(lending_co_data.iloc[: , 3])

pandas.core.series.Series

In [70]:
# specificr rows from dataframe 
lending_co_data.iloc[[1, 3], :] # all cols between 1,3

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active

In [72]:
lending_co_data.iloc[:, [3, 1]] # [3, 1] -> column selct

                Location    Product
StringID
LoanID_1      Location 3  Product B
LoanID_2      Location 6  Product D
LoanID_3      Location 8  Product B
LoanID_4     Location 26  Product A
LoanID_5     Location 34  Product B
...                  ...        ...
LoanID_1039  Location 73  Product B
LoanID_1040  Location 82  Product A
LoanID_1041  Location 11  Product A
LoanID_1042  Location 26  Product B
LoanID_1043  Location 94  Product A

[1043 rows x 2 columns]

In [ ]:
#-------------indexing with .loc[]

In [73]:
lending_co_data

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
LoanID_1039,1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
LoanID_1040,1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
LoanID_1041,1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
LoanID_1042,1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
LoanID_1043,1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [75]:
lending_co_data.loc['LoanID_3']

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [76]:
lending_co_data.loc['LoanID_3', :] # makes it more readable

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [77]:
lending_co_data.loc['LoanID_3', 'Region']

'Region 3'

In [ ]:
lending_co_data.loc['Location'] #-- raise error  py will think we refer to row with label its location
# lending_co_data['Location'] should be like this to present

In [79]:
lending_co_data.loc[:, 'Location']

StringID
LoanID_1        Location 3
LoanID_2        Location 6
LoanID_3        Location 8
LoanID_4       Location 26
LoanID_5       Location 34
                  ...
LoanID_1039    Location 73
LoanID_1040    Location 82
LoanID_1041    Location 11
LoanID_1042    Location 26
LoanID_1043    Location 94
Name: Location, Length: 1043, dtype: object

In [ ]:
# -----------------few comments on using .loc[], iloc[]

In [81]:
lending_co_data.shape

(1043, 14)

In [82]:
lending_co_data

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
LoanID_1039,1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
LoanID_1040,1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
LoanID_1041,1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
LoanID_1042,1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
LoanID_1043,1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [ ]:
lending_co_data.iloc[1043, :] #error cuz not in range 0 - 1042

In [ ]:
lending_co_data.iloc[:, 14] # error cuz column at position 14 should be in rane 0 - 13

In [83]:
lending_co_data['TotalPrice'].iloc[0]

17600.0

In [84]:
lending_co_data['TotalPrice'][0]

C:\Users\brkyb\AppData\Local\Temp\ipykernel_7312\1605309455.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  lending_co_data['TotalPrice'][0]

17600.0

In [85]:
lending_co_data['TotalPrice'][1]

C:\Users\brkyb\AppData\Local\Temp\ipykernel_7312\165894374.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  lending_co_data['TotalPrice'][1]

nan

In [86]:
lending_co_data['TotalPrice'].iloc[1]

nan

In [87]:
lending_co_data

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
LoanID_1039,1039,Product B,Male,Location 73,Region 6,17300.0,29/12/2018,2200,45,365,3251,4743,16617,Finished Payment
LoanID_1040,1040,Product A,Male,Location 82,Region 1,NaN,28/03/2018,2200,45,365,4090,5582,16617,Finished Payment
LoanID_1041,1041,Product A,NotSpecified,Location 11,Region 4,17300.0,26/04/2018,2200,45,365,4051,5143,16617,Finished Payment
LoanID_1042,1042,Product B,Female,Location 26,Region 6,16300.0,25/10/2016,1000,45,365,1930,3462,15617,Finished Payment
LoanID_1043,1043,Product A,NotSpecified,Location 94,Region 6,17300.0,15/05/2019,2200,45,365,4451,4743,16617,Finished Payment

In [90]:
data = pd.read_csv('Lending-company.csv', index_col = 'StringID')
lending_co_data = data.copy()
lending_co_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [91]:
lending_co_data['TotalPrice'].iloc[0]

17600.0

In [93]:
lending_co_data['TotalPrice'].loc['LoanID_1']

17600.0

In [94]:
lending_co_data['TotalPrice'][0] # avoid using

C:\Users\brkyb\AppData\Local\Temp\ipykernel_7312\1605309455.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  lending_co_data['TotalPrice'][0]

17600.0

In [ ]:
# Py allows chain indexing and iloc or loc index together

In [95]:
lending_co_data.iloc[0][5]

C:\Users\brkyb\AppData\Local\Temp\ipykernel_7312\1538933843.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  lending_co_data.iloc[0][5]

17600.0

In [97]:
lending_co_data.iloc[0, 5]

17600.0

In [98]:
lending_co_data.iloc[[0, 5]] #

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [99]:
lending_co_data.iloc[[0, 5], :]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [100]:
lending_co_data['TotalPrice']['LoanID_1']

17600.0

In [102]:
lending_co_data.loc['LoanID_1', 'TotalPrice']

17600.0

In [104]:
lending_co_data.loc[['LoanID_1', 'LoanID_6']]

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [105]:
lending_co_data.loc[['LoanID_1', 'LoanID_6'], :]# advised approach

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_6,6,Product A,Male,Location 34,Region 1,NaN,19/04/2019,2200,45,365,3301,4066,15141,Active

In [106]:
lending_co_data.TotalPrice['LoanID_1'] # not recomende

17600.0

In [107]:
lending_co_data['TotalPrice'].iloc[[0, 5]]

StringID
LoanID_1    17600.0
LoanID_6        NaN
Name: TotalPrice, dtype: float64

In [108]:
lending_co_data.loc[:, 'TotalPrice'].iloc[[0, 5]]

StringID
LoanID_1    17600.0
LoanID_6        NaN
Name: TotalPrice, dtype: float64